In [2]:
import pandas as pd
import numpy as np

In [3]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [4]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [5]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [7]:
df1 = pd.DataFrame(np.arange(9.).reshape(3,3), columns=list('bcd'), index=['Apple','Banana','Grape'])
df2 = pd.DataFrame(np.arange(12.).reshape(4,3), columns=list('abc'), index=['Apple','Banana','Watermelon','Lemon'])
df1

          b    c    d
Apple   0.0  1.0  2.0
Banana  3.0  4.0  5.0
Grape   6.0  7.0  8.0

In [8]:
df2

              a     b     c
Apple       0.0   1.0   2.0
Banana      3.0   4.0   5.0
Watermelon  6.0   7.0   8.0
Lemon       9.0  10.0  11.0

In [9]:
df1+df2

             a    b    c   d
Apple      NaN  1.0  3.0 NaN
Banana     NaN  7.0  9.0 NaN
Grape      NaN  NaN  NaN NaN
Lemon      NaN  NaN  NaN NaN
Watermelon NaN  NaN  NaN NaN

In [10]:
df1.add(df2)

             a    b    c   d
Apple      NaN  1.0  3.0 NaN
Banana     NaN  7.0  9.0 NaN
Grape      NaN  NaN  NaN NaN
Lemon      NaN  NaN  NaN NaN
Watermelon NaN  NaN  NaN NaN

In [11]:
df2.add(df1, fill_value=0)

              a     b     c    d
Apple       0.0   1.0   3.0  2.0
Banana      3.0   7.0   9.0  5.0
Grape       NaN   6.0   7.0  8.0
Lemon       9.0  10.0  11.0  NaN
Watermelon  6.0   7.0   8.0  NaN

In [12]:
df1.sub(2)

          b    c    d
Apple  -2.0 -1.0  0.0
Banana  1.0  2.0  3.0
Grape   4.0  5.0  6.0

In [13]:
df2.rsub(2)

              a    b    c
Apple       2.0  1.0  0.0
Banana     -1.0 -2.0 -3.0
Watermelon -4.0 -5.0 -6.0
Lemon      -7.0 -8.0 -9.0

In [27]:
df = pd.DataFrame(np.arange(1, 13.).reshape(3,4), index=list('abc'), columns=['Apple','Banana','Grape', 'Watermelon'])
obj = pd.Series([1, 1, 2, 2], index=df.columns)
df

   Apple  Banana  Grape  Watermelon
a    1.0     2.0    3.0         4.0
b    5.0     6.0    7.0         8.0
c    9.0    10.0   11.0        12.0

In [19]:
obj

Apple         1
Banana        1
Grape         2
Watermelon    2
dtype: int64

In [20]:
df+obj

   Apple  Banana  Grape  Watermelon
a    2.0     3.0    5.0         6.0
b    6.0     7.0    9.0        10.0
c   10.0    11.0   13.0        14.0

In [28]:
obj = pd.Series([2, 3, 1], index=['Apple', 'Grape', 'Watermelon'])
obj

Apple         2
Grape         3
Watermelon    1
dtype: int64

In [29]:
df.sub(obj)

   Apple  Banana  Grape  Watermelon
a   -1.0     NaN    0.0         3.0
b    3.0     NaN    4.0         7.0
c    7.0     NaN    8.0        11.0

In [30]:
df

   Apple  Banana  Grape  Watermelon
a    1.0     2.0    3.0         4.0
b    5.0     6.0    7.0         8.0
c    9.0    10.0   11.0        12.0

In [31]:
obj['Apple']

np.int64(2)

In [32]:
df + obj['Apple']

   Apple  Banana  Grape  Watermelon
a    3.0     4.0    5.0         6.0
b    7.0     8.0    9.0        10.0
c   11.0    12.0   13.0        14.0